class YaScooterOrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'Тест',
            'last_name': 'Тестовна',
            'address': 'Красивая улица',
            'subway': 'Беговая',
            'telephone': '79152214567',
            'date': '30.01.2025',
            'r_period': 0,
            'colour': [0],
            'comment': 'Буду в бордовом пальто и черной шляпе'
        },
        'data_set2':
            {'first_name': 'Тестовая',
             'last_name': 'Тестенко',
             'address': 'Самокатная улица',
             'subway': 'Лубянка',
             'telephone': '89265554717',
             'date': '29.01.2025',
             'r_period': 1,
             'colour': [0, 1],
             'comment': 'Желательно синий самокат'
             },
    }



faq_ansvers_text = [
    "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
    "Да, обязательно. Всем самокатов! И Москве, и Московской области.",
]

